denote/20221217T192846--make2help__code-reading.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-01-04 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>make2helpを読む</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel="preconnect" href="https://fonts.googleapis.com"><link rel="preconnect" href="https://fonts.gstatic.com" crossorigin><link href="https://fonts.googleapis.com/css2?family=Ultra&display=swap" rel="stylesheet"><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">make2helpを読む</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga5e80a2">make2help</a>
<ul>
<li><a href="#org182fd29">流れ</a></li>
<li><a href="#orgd8ee430">ファイル分け</a>
<ul>
<li><a href="#org83aa32a">rules</a></li>
<li><a href="#orge1d052a">make2help</a></li>
<li><a href="#org6193be3">cli</a></li>
<li><a href="#orgb56d356">cmd/main</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgbd81470">一般的に使えそうなmemo</a>
<ul>
<li><a href="#orgfbf5e12">cliが呼び出す部分</a></li>
<li><a href="#org37379c9">引数をparseする</a></li>
<li><a href="#orgfb0ae3a">正規表現 MustCompile を使う</a></li>
<li><a href="#org26226ff">定数で扱う</a></li>
<li><a href="#org51c5a90">cmd/main.goでは構造体の初期化と1メソッドを呼び出すだけ</a></li>
<li><a href="#orgf8c54b5">同じことを検証する</a></li>
<li><a href="#orgb713e7e">rulesのメソッド</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orga5e80a2" class="outline-2">
<h2 id="orga5e80a2"><a href="#orga5e80a2">make2help</a></h2>
<div class="outline-text-2" id="text-orga5e80a2">
<p>
make2helpはmakefileのヘルプを表示する Go パッケージ。Makefileのコメントから自動生成してくれる。ミニマルな機能で取り組みやすかった。
</p>
</div>

<div id="outline-container-org182fd29" class="outline-3">
<h3 id="org182fd29"><a href="#org182fd29">流れ</a></h3>
<div class="outline-text-3" id="text-org182fd29">
<ul class="org-ul">
<li>コマンドライン処理</li>
<li>ファイルをパース</li>
<li>固定のキーワードは無視</li>
<li>タスクとコメントを抽出</li>
<li>いい感じに表示</li>
</ul>
</div>
</div>

<div id="outline-container-orgd8ee430" class="outline-3">
<h3 id="orgd8ee430"><a href="#orgd8ee430">ファイル分け</a></h3>
<div class="outline-text-3" id="text-orgd8ee430">
</div>
<div id="outline-container-org83aa32a" class="outline-4">
<h4 id="org83aa32a"><a href="#org83aa32a">rules</a></h4>
<div class="outline-text-4" id="text-org83aa32a">
<p>
表示を扱うmap構造とメソッド集。
</p>
</div>
</div>
<div id="outline-container-orge1d052a" class="outline-4">
<h4 id="orge1d052a"><a href="#orge1d052a">make2help</a></h4>
<div class="outline-text-4" id="text-orge1d052a">
<p>
ファイルのスキャンしてrulesを生成する。
</p>
</div>
</div>
<div id="outline-container-org6193be3" class="outline-4">
<h4 id="org6193be3"><a href="#org6193be3">cli</a></h4>
<div class="outline-text-4" id="text-org6193be3">
<p>
コマンドライン引数を処理する。
</p>
</div>
</div>
<div id="outline-container-orgb56d356" class="outline-4">
<h4 id="orgb56d356"><a href="#orgb56d356">cmd/main</a></h4>
<div class="outline-text-4" id="text-orgb56d356">
<p>
cli構造体のメソッドを実行する。
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgbd81470" class="outline-2">
<h2 id="orgbd81470"><a href="#orgbd81470">一般的に使えそうなmemo</a></h2>
<div class="outline-text-2" id="text-orgbd81470">
</div>
<div id="outline-container-orgfbf5e12" class="outline-3">
<h3 id="orgfbf5e12"><a href="#orgfbf5e12">cliが呼び出す部分</a></h3>
<div class="outline-text-3" id="text-orgfbf5e12">
<div class="org-src-container">
<pre class="src src-git-permalink">https://github.com/Songmu/make2help/blob/7d76187a6c490467f3e0ca879ae6eb1c1ec0d30b/cli.go#L43-L53
</pre>
</div>

<div class="results" id="org68e3c20">
<p>
r := rules{}
for _, f := range argv {
	tmpRule, err := scan(f)
	if err != nil {
		fmt.Fprintln(cli.ErrStream, err)
		return exitCodeErr
	}
	r = r.merge(tmpRule)
}
fmt.Fprint(cli.OutStream, r.string(all, colorful))
return exitCodeOK
</p>

</div>

<ul class="org-ul">
<li>CLIがiotaでOKや各種Errorを返す。すべて正常実行の扱いで、panicを使わない</li>
<li>ruleを作成して、それぞれバッファに書き込む</li>
</ul>
</div>
</div>

<div id="outline-container-org37379c9" class="outline-3">
<h3 id="org37379c9"><a href="#org37379c9">引数をparseする</a></h3>
<div class="outline-text-3" id="text-org37379c9">
<div class="org-src-container">
<pre class="src src-git-permalink">https://github.com/Songmu/make2help/blob/7d76187a6c490467f3e0ca879ae6eb1c1ec0d30b/cli.go#L61-L74
</pre>
</div>

<div class="results" id="orga7c6467">
<p>
func parseFlags(argv []string) (restArgv []string, isHelp, isAll bool) {
	for _, v := range argv {
		if helpReg.MatchString(v) {
			isHelp = true
			return
		}
		if allReg.MatchString(v) {
			isAll = true
			continue
		}
		restArgv = append(restArgv, v)
	}
	return
}
</p>

</div>

<p>
直に受け取ったargvをパースする。
</p>
</div>
</div>

<div id="outline-container-orgfb0ae3a" class="outline-3">
<h3 id="orgfb0ae3a"><a href="#orgfb0ae3a">正規表現 MustCompile を使う</a></h3>
<div class="outline-text-3" id="text-orgfb0ae3a">
<p>
動的ではなく、コンパイル前に実行する。
</p>

<div class="org-src-container">
<pre class="src src-git-permalink">https://github.com/Songmu/make2help/blob/7d76187a6c490467f3e0ca879ae6eb1c1ec0d30b/cli.go#L56-L59
</pre>
</div>

<div class="results" id="org3f355aa">
<p>
var (
	helpReg = regexp.MustCompile(`^&#x2013;?h(?:elp)?\(`)
	allReg  = regexp.MustCompile(`^--?all\)`)
)
</p>

</div>
</div>
</div>

<div id="outline-container-org26226ff" class="outline-3">
<h3 id="org26226ff"><a href="#org26226ff">定数で扱う</a></h3>
<div class="outline-text-3" id="text-org26226ff">
<p>
文字列が、キーワードに含まれるどうかを判定する。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>最初に、定数で各キーワードを定義しておく</label><pre class="src src-git-permalink">https://github.com/Songmu/make2help/blob/7d76187a6c490467f3e0ca879ae6eb1c1ec0d30b/make2help.go#L12-L14
</pre>
</div>

<div class="results" id="orge067953">
<p>
const (
	builtInTargetPhony              = &ldquo;.PHONY&rdquo;
	builtInTargetSuffixes           = &ldquo;.SUFFIXES&rdquo;
</p>

</div>

<p>
それをmapにする。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>mapにする</label><pre class="src src-git-permalink">https://github.com/Songmu/make2help/blob/7d76187a6c490467f3e0ca879ae6eb1c1ec0d30b/make2help.go#L29-L34
</pre>
</div>

<div class="results" id="org5544f3f">
<p>

</p>

<p>
var (
	ruleReg          = regexp.MustCompile(`^([^\s]+)\s*:`)
	isBuiltInTargets = map[string]bool{
		builtInTargetPhony:              true,
		builtInTargetSuffixes:           true,
</p>

</div>

<p>
使用例。targetにキーワードが含まれていれば、trueを返す。
</p>

<div class="org-src-container">
<pre class="src src-git-permalink">https://github.com/Songmu/make2help/blob/7d76187a6c490467f3e0ca879ae6eb1c1ec0d30b/make2help.go#L69
</pre>
</div>

<div class="results" id="org7a7d701">
<p>
if isBuiltInTargets[target] {
</p>

</div>
</div>
</div>

<div id="outline-container-org51c5a90" class="outline-3">
<h3 id="org51c5a90"><a href="#org51c5a90">cmd/main.goでは構造体の初期化と1メソッドを呼び出すだけ</a></h3>
<div class="outline-text-3" id="text-org51c5a90">
<p>
1行だけでシンプル。
</p>

<div class="org-src-container">
<pre class="src src-git-permalink">https://github.com/Songmu/make2help/blob/7d76187a6c490467f3e0ca879ae6eb1c1ec0d30b/cmd/make2help/main.go#L10
</pre>
</div>

<div class="results" id="org8e9f938">
<p>
os.Exit((&amp;make2help.CLI{ErrStream: os.Stderr, OutStream: os.Stdout}).Run(os.Args[1:]))
</p>

</div>
</div>
</div>

<div id="outline-container-orgf8c54b5" class="outline-3">
<h3 id="orgf8c54b5"><a href="#orgf8c54b5">同じことを検証する</a></h3>
<div class="outline-text-3" id="text-orgf8c54b5">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>reflect.DeepEqualを使う</label><pre class="src src-git-permalink">https://github.com/Songmu/make2help/blob/7d76187a6c490467f3e0ca879ae6eb1c1ec0d30b/make2help_test.go#L25-L27
</pre>
</div>

<div class="results" id="org7b01408">
<p>
if !reflect.DeepEqual(r, expect) {
	t.Errorf(&ldquo;somthing went wrong\n   got: %#v\nexpect: %#v&rdquo;, r, expect)
}
</p>

</div>
</div>
</div>

<div id="outline-container-orgb713e7e" class="outline-3">
<h3 id="orgb713e7e"><a href="#orgb713e7e">rulesのメソッド</a></h3>
<div class="outline-text-3" id="text-orgb713e7e">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span>rulesはmap</label><pre class="src src-git-permalink">https://github.com/Songmu/make2help/blob/7d76187a6c490467f3e0ca879ae6eb1c1ec0d30b/rules.go#L11
</pre>
</div>

<div class="results" id="org722a595">
<p>
type rules map[string][]string
</p>

</div>

<p>
rulesに定義されているメソッドはmerge, string, indentAndRules。シンプルな定義と、一般的な操作として定義されている。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
